/**
 * 文章列表
 */
define([
   'ArticleType',
   'CETWord',
   'english-vocabulary/CET4mini',
   'phrase/Phrase'
], function (
    ArticleType,
    CETWord,
    CET4mini,
    Phrase
) {

   // 字符串 -> []英文单词
   function getWordsArrayFrom(contentStr) {
      let tempArray = contentStr.split('\n');
      let tempArrayAll = [];
      tempArray.forEach(item => {
         let wordArray = item.split('\t');
         tempArrayAll.push(new CETWord(wordArray[0], wordArray[1]));
      })
      return tempArrayAll
   }
   // 字符串 -> []词条
   function getPhraseArrayFrom(contentStr) {
      return contentStr.split('\n');
   }

   return {
      errab: {
         name: '错字',
         value: 'errab', 
         type: ArticleType.character,
         content: '客城离包商群志然至场交各该员注传使期斯热等紧党觉辉念刻势冷呼药充鼓构愈旅偷幕摸夺赏惜朗跃塔岛剩督吐臂辟宿尘辉拾恰耐飘斜慰尉饰',
      },
      top500: {
         name: '常用前500',
         value: 'top500',
         type: ArticleType.character,
         content: '的一是了不在有个人这上中大为来我到出要以时和地们得可下对生也子就过能他会多发说而于自之用年行家方后作成开面事好小心前所道法如进着同经分定都然与本还其当起动已两点从问里主实天高去现长此三将无国全文理明日些看只公等十意正外想间把情者没重相那向知因样学应又手但信关使种见力名二处门并口么先位头回话很再由身入内第平被给次别几月真立新通少机打水果最部何安接报声才体今合性西你放表目加常做己老四件解路更走比总金管光工结提任东原便美及教难世至气神山数利书代直色场变记张必受交非服化求风度太万各算边王什快许连五活思该步海指物则女或完马强言条特命感清带认保望转传儿制干计民白住字它义车像反象题却流且即深近形取往系量论告息让决未花收满每华业南觉电空眼听远师元请容她军士百办语期北林识半夫客战院城候单音台死视领失司亲始极双令改功程爱德复切随李员离轻观青足落叫根怎持精送众影八首包准兴红达早尽故房引火站似找备调断设格消拉照布友整术石展紧据终周式举飞片虽易运笑云建谈界务写钱商乐推注越千微若约英集示呢待坐议乎留称品志黑存六造低江念产刻节尔吃势依图共曾响底装具喜严九况跟罗须显热病证刚治绝群市阳确究久除闻答段官政类黄武七支费父统'
         // content: '还很由等被部今西场该或命感保望传觉她士期领青落怎影早备格拉整石紧约英乎留称品志低念刻势曾须显热市久费父'
      },
      mid500: {
         name: '常用中500',
         value: 'mid500',
         type: ArticleType.character,
         content: '查般斯倒突号树拿克初广奇愿欢希母香破谁致线急古既句京甚仍晚争游龙余护另器细木权星哪苦孩试朝阿队居害独讲错局男差参社换选止际假汉够诉资密案史较环投静宝专修室区料帮衣竟模脸善兵考规联团冷玉施派纪采历顾春责夜画惊银负续吗简章左块索酒值态按陈河巴冲阵境助角户乱呼灵脚继楼景怕停铁异谢否伤兰置医良承福科属围需退基右速适药怀击买素背岁土忙充排价质遇端列印贵疑露哥杀标招血礼弟亮齐穿脑委州某顺省讨尚维板散项状追笔副层沙养读习永草胡济执察归富座雨堂威忽苏船罪敢妇村著食导免温莫掌激慢托胜险寻守波雷沉秀职验靠楚略族藏丽渐刘仅肯担扬盘唐钟级毛营坚松皮供店饭范哈赶吧雪斗效临农味恶烟园烈配杂短卫跳孙曲封抓移顿律卖艺旧朋救防脱翻划迎痛校窗宣乡杨叶警限湖软掉财词压挥超屋秋跑忘馆暗班党宗坏技困登姐预耳席梦朱组旁份禁套亚益探康增诗戏伯晓含劳恩顶君庄谓付田毕纸研虚怪宁替犯灯优您姓例丝盖误架幸隐股毒娘占智佛床米凡介征彩演射祖欲束获舞圣伙梅普借私源镇睡缓升纳织歌宫概野醒夏互积街牌休摇洋败监骨批兄刀网率庭熟创访硬仁菜丁绿牛避阴拍雄秘缺卷姑尼油恐玩释遍握球降虑荣策肉妈迷检伸欧攻练育危厅啊睛摆茶勇判材抱亦妻吸喝趣嘴逐操午吉浪轮默毫冰珠'
         // content: '查斯倒拿克广愿致仍晚争苦孩居害参社换际够诉脸联冷春夜画吗陈巴户呼脚继景铁谢基药岁充列委顺尚养草座船著掌寻守秀职渐肯级恶卫孙救防划杨警限秋暗党持困登朱探增伯含君庄怪隐欲普睡宫互街摇洋监批兄率庭熟菜绿避秘卷姑恐遍球降迷检欧攻厅茶判亦妻吸逐午默冰'
      },
      tail500: {
         name: '常用后500',
         value: 'tail500',
         type: ArticleType.character,
         content: '鼓阶孔徐固偏陆诸遗爷述帝闭补编巨透弄尤鲁拥录吴墙货弱敌挑宽迹抽忍折输稳皇桌献蒙纷麻洗评挂童尊舍唯博剧乃混弹附迟敬杯鱼控塞剑厚佳测训牙洞淡盛县芳雅革款横累择乘刺载猛逃构赵杜庆途奔虎巧抗针徒圆闪谷绍聚额健诚鲜泪闲均序震仿缘戴婚篇亡奶忠烦赛闹协杰残懂丹柳妹映桥叹愈旅授享暴偷蓝氏寒宜弃丰延辈抢颜赞典冒眉烧厂唱径库川辞伴怒型纯贝票隔穷拜审伦悲柔启减页纵扫伟迫振瑞丈梁洲枪央触予孤缩洛损促番罢宋奋销幕犹锁珍抬陪妙摸峰劲镜沈夺昨哭讯貌谋泰侧贫扶阻贴申岸彼赏版抵泽插迅凭伊潮咱仙符宇肩尝递燕洁拒郎凝净遭仪薄卡末勒乌森诺呀壮忧沿惯丢季企壁惜婆袋朗零辛忆努舒枝凤灭韩胆灰旦孟陷俗绕疾瞧洪甲帐糊泛皆碰吹码奉箱倾胸堆狂仲圈冬餐厉腿尖括佩鬼欣垂跃港骗融撞塔紫荡敏郑赖滑允鸟课暂瓦祥染滚浮粗刑辆狗扑稍秦扎魂岛腾臣琴悉络摩措域冠竹殊豪呆萨旋喊寄悄倍祝剩督旗返召彻宾甘吐乔腰拔幅违详臂尺饮颗涉逼竞培惠亏叔伏唤鸡邻池怨奥侯骑漫拖俊尾恨贯凌兼询碎晨罚铺浓伍宿泉井繁粉绪筑恢匹尘辉魔仰董描距盗渡勤劝莲坦搭挺踪幽截荒恰慧邦颇焦醉废掩签丧灾鼻侵陶肃裁俱磨析奖匆瓶泥拾凉麦钢涌潜隆津搞蛋奈扰耐傅锦播墨偶捕惑飘屈鸣挤毁斜啦污赤慰饰锋覆汤寿跨羊航'
         // content: '泪鼓偏弱敌宽抽忍折献洗挂童尊乃塞佳洞淡盛雅革累载猛构杜庆抗针徒圆闪额奶赛协叹愈旅享偷寒丰辈颜赞库川辞型贝票拜审悲柔减伟振央予孤宋幕犹摸夺昨哭貌申岸赏版凭宇肩递燕郎遭呀季企壁惜婆朗零辛忆舒凤灭韩灰旦孟俗胸仲冬餐尖跃港骗撞塔紫敏赖允粗刑扑岛臣琴域冠豪呆悄剩督召宾甘吐幅违臂辟逼竞邻池漫恨碎晨罚伍宿泉井繁匹尘辉魔仰盗勤搭挺幽荒恰废掩灾肃磨析泥拾凉麦隆耐播墨惑飘毁斜赤慰尉饰羊'
      },
      oneab: {
         name: '一简',
         value: 'oneab',
         type: ArticleType.character,
         content: '和都着其要土吗里给以她子己已由山',
      },
      twoab: {
         name: '二简',
         value: 'twoab',
         type: ArticleType.character,
         content: '定燕烟科晚春餐普参与怀宁呀道平离季洋放级诉保审实然站变宾怪胆胸尖承绿志夺睡昨后悄隐列防低基原社际景铁充顺笔空肯卫限财菜率避秘降慢职杂屯划杨妻吸吉检攻厅睛朱增互弱宽冰抽折淡累载构针客闻婚库孤忍换陈良怕药争渐暗伯批珠协丰粗恨晨罚粉恰灾毁'
      },
      twore: {
         name: '二重',
         value: 'twore',
         type: ArticleType.character,
         content: '觉死贝士想监警',
      },
      threeab: {
         name: '三简',
         value: 'threeab',
         type: ArticleType.character,
         content: '利孩刻壮讨状油待仅论乘乖秉迫妙熟苦朗访付艺私异拍照齐雷松烈庄甲住敌皇杜闲仿亡予寻肖草艺齐兄牛遍泪叹页冬扎'
      },
      threere: {
         name: '三重',
         value: 'threere',
         type: ArticleType.character,
      content: '热街怎够卷使传庭尤剩寸繁俗竞尢',
      },
      fourfull: {
         name: '四全',
         value: 'fourfull',
         type: ArticleType.character,
         content: '惊欲场犹仲港塔遭监恐靠探石领堂摸貌冷值脚围尚哭郎游该登射肩冠豪域摩刑督票柔察堂船掌恶救登探含牌监判鼓资霞甜贵靠扁命偏童猛抗徒圆赛愈旅辈颜川辞型摸救翻篇岸零韩跃违邻漫宿辉仰荒掩警君港',
      },
      fourre: {
         name: '四重',
         value: 'fourre',
         type: ArticleType.character,
         content: '惜雨敏赖致默党赏凭养赞幕鉴兑播斜览',
         content: '惜雨敏赖致默党赏凭养赞幕鉴兑播斜览',
      },
      phrase: {
         name: '常用词条',
         value: 'phrase',
         type: ArticleType.phrase,
         content: '雨推敏赖推命致疑露礼警词庭默',
      },
      CET4: {
         name: '四级',
         value: 'CET4',
         type: ArticleType.word,
         content: CET4mini.content,
         getWordsArray() { return getWordsArrayFrom(CET4mini.content)}
      },
      article1: {
         name: '春 - 朱自清',
         value: 'article1',
         type: ArticleType.article,
         content: "盼望着，盼望着，东风来了，春天的脚步近了。一切都像刚睡醒的样子，欣欣然张开了眼。山朗润起来了，水涨起来了，太阳的脸红起来了。小草偷偷地从土里钻出来，嫩嫩的，绿绿的。园子里，田野里，瞧去，一大片一大片满是的。坐着，躺着，打两个滚，踢几脚球，赛几趟跑，捉几回迷藏。风轻悄悄的，草软绵绵的。桃树、杏树、梨树，你不让我，我不让你，都开满了花赶趟儿。红的像火，粉的像霞，白的像雪。花里带着甜味儿；闭了眼，树上仿佛已经满是桃儿、杏儿、梨儿。花下成千成百的蜜蜂嗡嗡地闹着，大小的蝴蝶飞来飞去。野花遍地是：杂样儿，有名字的，没名字的，散在草丛里，像眼睛，像星星，还眨呀眨的。“吹面不寒杨柳风”，不错的，像母亲的手抚摸着你。风里带来些新翻的泥土的气息，混着青草味儿，还有各种花的香，都在微微润湿的空气里酝酿。鸟儿将窠巢安在繁花嫩叶当中，高兴起来了，呼朋引伴地卖弄清脆的喉咙，唱出宛转的曲子，与轻风流水应和着。牛背上牧童的短笛，这时候也成天在嘹亮地响。雨是最寻常的，一下就是三两天。可别恼。看，像牛毛，像花针，像细丝，密密地斜织着，人家屋顶上全笼着一层薄烟。树叶子却绿得发亮，小草也青得逼你的眼。傍晚时候，上灯了，一点点黄晕的光，烘托出一片安静而和平的夜。乡下去，小路上，石桥边，有撑起伞慢慢走着的人；还有地里工作的农夫，披着蓑，戴着笠的。他们的草屋，稀稀疏疏的，在雨里静默着。天上风筝渐渐多了，地上孩子也多了。城里乡下，家家户户，老老小小，他们也赶趟儿似的，一个个都出来了。舒活舒活筋骨，抖擞抖擞精神，各做各的一份事去。“一年之计在于春”，刚起头儿，有的是工夫，有的是希望。春天像刚落地的娃娃，从头到脚都是新的，他生长着。春天像小姑娘，花枝招展的，笑着，走着。春天像健壮的青年，有铁一般的胳膊和腰脚，他领着我们上前去。"
      },
      article2: {
         name: '秋天的怀念 - 史铁生',
         value: 'article3',
         type: ArticleType.article,
         content: "双腿瘫痪后，我的脾气变得暴怒无常。望着望着天上北归的雁阵，我会突然把面前的玻璃砸碎；听着听着李谷一甜美的歌声，我会猛地把手边的东西摔向四周的墙壁。母亲就悄悄地躲出去，在我看不见的地方偷偷地听着我的动静。当一切恢复沉寂，她又悄悄地进来，眼边红红的，看着我。“听说北海的花儿都开了，我推着你去走走。”她总是这么说。母亲喜欢花，可自从我的腿瘫痪后，她侍弄的那些花都死了。“不，我不去！”我狠命地捶打这两条可恨的腿，喊着：“我活着有什么劲！”母亲扑过来抓住我的手，忍住哭声说：“咱娘儿俩在一块儿，好好儿活，好好儿活……”可我却一直都不知道，她的病已经到了那步田地。后来妹妹告诉我，她常常肝疼得整宿整宿翻来覆去地睡不了觉。那天我又独自坐在屋里，看着窗外的树叶“唰唰啦啦”地飘落。母亲进来了，挡在窗前：“北海的菊花开了，我推着你去看看吧。”她憔悴的脸上现出央求般的神色。“什么时候？”“你要是愿意，就明天？”她说。我的回答已经让她喜出望外了。“好吧，就明天。”我说。她高兴得一会坐下，一会站起：“那就赶紧准备准备。”“唉呀，烦不烦？几步路，有什么好准备的！”她也笑了，坐在我身边，絮絮叨叨地说着：“看完菊花，咱们就去‘仿膳’，你小时候最爱吃那儿的豌豆黄儿。还记得那回我带你去北海吗？你偏说那杨树花是毛毛虫，跑着，一脚踩扁一个……”她忽然不说了。对于“跑”和“踩”一类的字眼儿。她比我还敏感。她又悄悄地出去了。她出去了。就再也没回来。邻居们把她抬上车时，她还在大口大口地吐着鲜血。我没想到她已经病成那样。看着三轮车远去，也绝没有想到那竟是永远的诀别。邻居的小伙子背着我去看她的时候，她正艰难地呼吸着，像她那一生艰难的生活。别人告诉我，她昏迷前的最后一句话是：“我那个有病的儿子和我那个还未成年的女儿……”又是秋天，妹妹推我去北海看了菊花。黄色的花淡雅、白色的花高洁、紫红色的花热烈而深沉，泼泼洒洒，秋风中正开得烂漫。我懂得母亲没有说完的话。妹妹也懂。我俩在一块儿，要好好儿活……"
      },
      customize: {
         name: '自定义发文',
         value: 'customize',
         type: ArticleType.customize,
         content: "",
      }
   }
})


