/**
 * 文章列表
 */
define([
   'ArticleType',
   'CETWord',
   'english-vocabulary/CET4mini',
   'phrase/Phrase'
], function (
    ArticleType,
    CETWord,
    CET4mini,
    Phrase
) {

   // 字符串 -> []英文单词
   function getWordsArrayFrom(contentStr) {
      let tempArray = contentStr.split('\n');
      let tempArrayAll = [];
      tempArray.forEach(item => {
         let wordArray = item.split('\t');
         tempArrayAll.push(new CETWord(wordArray[0], wordArray[1]));
      })
      return tempArrayAll
   }
   // 字符串 -> []词条
   function getPhraseArrayFrom(contentStr) {
      return contentStr.split('\n');
   }

   return {
      errab: {
         name: '错字',
         value: 'errab', 
         type: ArticleType.character,
         content: '遗查戴婚猛庆杜丰川票拜审负放柔启仲圆额雨寸探娇觉辉围什石鼓构愈偷摸夺赏惜朗塔岛剩督臂宿尘拾恰斜慰尉饰',
      },
      top500: {
         name: '常用前500',
         value: 'top500',
         type: ArticleType.character,
         content: '座船职靠卫而道法着都其向使位由被给常场连该强条命保题告容她期死领随房拉整石笑云建约示待乎留称刻势底热绝官'
      },
      mid500: {
         name: '常用中500',
         value: 'mid500',
         type: ArticleType.character,
         content: '斯倒拿广愿欢致既甚游龙际诉考冷派惊吗列贵露穿州顺尚养习寻供烈短卫财登预君怪宁优您误隐智床射欲概街牌摇洋监兄率庭熟仁避秘卷遍球降检欧危厅睛茶材亦妻默吸'
      },
      tail500: {
         name: '常用后500',
         value: 'tail500',
         type: ArticleType.character,
         content: '鼓孔偏遗拥抽忍皇献蒙洗挂童尊博敬控塞剑厚佳牙洞芳雅累乘刺庆奔虎聚额健戴愈柔予缩宋幕犹摸峰劲镜沈哭申岸赏插凭肩尝递燕拒薄乌呀企壁婆零辛努舒凤灭胆堆狂仲圈垂跃港融撞荡敏滚刑狗扑扎岛臣琴措域冠豪呆萨寄悄祝召彻宾甘吐乔腰颗涉竞惠繁粉绪匹尘魔仰距盗渡勤挺颇醉废掩磨奖凉麦隆津蛋耐锦播墨捕惑飘毁斜污赤慰饰覆寿羊航'
      },
      twoab: {
         name: '二简',
         value: 'twoab',
         type: ArticleType.character,
         content: '定燕烟晚春餐普参与怀宁呀道平离季洋放诉保审实然站变宾怪胆胸尖承绿志夺睡昨后悄隐列防低基原社际景铁充顺笔肯卫限财菜率避秘降慢职杂屯划杨妻吸吉检攻厅睛朱增互弱宽冰抽折淡累载构针客闻婚库孤忍换陈良怕药争渐暗伯批珠协丰粗恨晨罚粉恰灾毁'
      },
      twore: {
         name: '二重',
         value: 'twore',
         type: ArticleType.character,
         content: '觉死士想监辉警尤怎石场',
      },
      threeab: {
         name: '三简',
         value: 'threeab',
         type: ArticleType.character,
         content: '利孩刻仅乘乖秉妙苦异拍照齐雷松烈庄甲住敌皇杜闲仿予寻肖草艺齐兄牛遍泪叹页冬扎'
      },
      threere: {
         name: '三重',
         value: 'threere',
         type: ArticleType.character,
      content: '热街够卷庭剩寸繁俗竞赁览斜赞黩速牌',
      },
      fourfull: {
         name: '四全',
         value: 'fourfull',
         type: ArticleType.character,
         content: '惊欲犹仲港塔遭恐靠探领堂摸冷值脚围尚哭郎游该登射冠豪域摩刑督票柔察堂船掌恶救登探含判鼓资霞甜贵靠扁命偏童猛抗徒圆愈旅辈颜川辞型摸救翻篇岸零韩跃违邻漫宿辉仰荒掩警君港',
      },
      CET4: {
         name: '四级',
         value: 'CET4',
         type: ArticleType.word,
         content: CET4mini.content,
         getWordsArray() { return getWordsArrayFrom(CET4mini.content)}
      },
      article1: {
         name: '春 - 朱自清',
         value: 'article1',
         type: ArticleType.article,
         content: "盼望着，盼望着，东风来了，春天的脚步近了。一切都像刚睡醒的样子，欣欣然张开了眼。山朗润起来了，水涨起来了，太阳的脸红起来了。小草偷偷地从土里钻出来，嫩嫩的，绿绿的。园子里，田野里，瞧去，一大片一大片满是的。坐着，躺着，打两个滚，踢几脚球，赛几趟跑，捉几回迷藏。风轻悄悄的，草软绵绵的。桃树、杏树、梨树，你不让我，我不让你，都开满了花赶趟儿。红的像火，粉的像霞，白的像雪。花里带着甜味儿；闭了眼，树上仿佛已经满是桃儿、杏儿、梨儿。花下成千成百的蜜蜂嗡嗡地闹着，大小的蝴蝶飞来飞去。野花遍地是：杂样儿，有名字的，没名字的，散在草丛里，像眼睛，像星星，还眨呀眨的。“吹面不寒杨柳风”，不错的，像母亲的手抚摸着你。风里带来些新翻的泥土的气息，混着青草味儿，还有各种花的香，都在微微润湿的空气里酝酿。鸟儿将窠巢安在繁花嫩叶当中，高兴起来了，呼朋引伴地卖弄清脆的喉咙，唱出宛转的曲子，与轻风流水应和着。牛背上牧童的短笛，这时候也成天在嘹亮地响。雨是最寻常的，一下就是三两天。可别恼。看，像牛毛，像花针，像细丝，密密地斜织着，人家屋顶上全笼着一层薄烟。树叶子却绿得发亮，小草也青得逼你的眼。傍晚时候，上灯了，一点点黄晕的光，烘托出一片安静而和平的夜。乡下去，小路上，石桥边，有撑起伞慢慢走着的人；还有地里工作的农夫，披着蓑，戴着笠的。他们的草屋，稀稀疏疏的，在雨里静默着。天上风筝渐渐多了，地上孩子也多了。城里乡下，家家户户，老老小小，他们也赶趟儿似的，一个个都出来了。舒活舒活筋骨，抖擞抖擞精神，各做各的一份事去。“一年之计在于春”，刚起头儿，有的是工夫，有的是希望。春天像刚落地的娃娃，从头到脚都是新的，他生长着。春天像小姑娘，花枝招展的，笑着，走着。春天像健壮的青年，有铁一般的胳膊和腰脚，他领着我们上前去。"
      },
      article2: {
         name: '秋天的怀念 - 史铁生',
         value: 'article3',
         type: ArticleType.article,
         content: "双腿瘫痪后，我的脾气变得暴怒无常。望着望着天上北归的雁阵，我会突然把面前的玻璃砸碎；听着听着李谷一甜美的歌声，我会猛地把手边的东西摔向四周的墙壁。母亲就悄悄地躲出去，在我看不见的地方偷偷地听着我的动静。当一切恢复沉寂，她又悄悄地进来，眼边红红的，看着我。“听说北海的花儿都开了，我推着你去走走。”她总是这么说。母亲喜欢花，可自从我的腿瘫痪后，她侍弄的那些花都死了。“不，我不去！”我狠命地捶打这两条可恨的腿，喊着：“我活着有什么劲！”母亲扑过来抓住我的手，忍住哭声说：“咱娘儿俩在一块儿，好好儿活，好好儿活……”可我却一直都不知道，她的病已经到了那步田地。后来妹妹告诉我，她常常肝疼得整宿整宿翻来覆去地睡不了觉。那天我又独自坐在屋里，看着窗外的树叶“唰唰啦啦”地飘落。母亲进来了，挡在窗前：“北海的菊花开了，我推着你去看看吧。”她憔悴的脸上现出央求般的神色。“什么时候？”“你要是愿意，就明天？”她说。我的回答已经让她喜出望外了。“好吧，就明天。”我说。她高兴得一会坐下，一会站起：“那就赶紧准备准备。”“唉呀，烦不烦？几步路，有什么好准备的！”她也笑了，坐在我身边，絮絮叨叨地说着：“看完菊花，咱们就去‘仿膳’，你小时候最爱吃那儿的豌豆黄儿。还记得那回我带你去北海吗？你偏说那杨树花是毛毛虫，跑着，一脚踩扁一个……”她忽然不说了。对于“跑”和“踩”一类的字眼儿。她比我还敏感。她又悄悄地出去了。她出去了。就再也没回来。邻居们把她抬上车时，她还在大口大口地吐着鲜血。我没想到她已经病成那样。看着三轮车远去，也绝没有想到那竟是永远的诀别。邻居的小伙子背着我去看她的时候，她正艰难地呼吸着，像她那一生艰难的生活。别人告诉我，她昏迷前的最后一句话是：“我那个有病的儿子和我那个还未成年的女儿……”又是秋天，妹妹推我去北海看了菊花。黄色的花淡雅、白色的花高洁、紫红色的花热烈而深沉，泼泼洒洒，秋风中正开得烂漫。我懂得母亲没有说完的话。妹妹也懂。我俩在一块儿，要好好儿活……"
      },
      customize: {
         name: '自定义发文',
         value: 'customize',
         type: ArticleType.customize,
         content: "",
      }
   }
})


